In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [7]:
df = pd.read_csv('array.txt', sep=' ', header=None)
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,30.0,67.0,39.0,29.0,94.0,95.0,80.0,95.0,45.0,93.0,...,7.0,46.0,1.0,82.0,66.0,15.0,57.0,55.0,23.0,96.0
1,94.0,34.0,80.0,79.0,50.0,84.0,91.0,20.0,86.0,72.0,...,59.0,69.0,26.0,99.0,81.0,19.0,57.0,22.0,23.0,0.0
2,40.0,69.0,50.0,25.0,85.0,82.0,25.0,29.0,25.0,1.0,...,14.0,51.0,66.0,14.0,72.0,75.0,58.0,9.0,70.0,24.0
3,29.0,7.0,54.0,7.0,60.0,31.0,97.0,9.0,29.0,98.0,...,28.0,16.0,49.0,39.0,69.0,82.0,70.0,42.0,17.0,93.0
4,88.0,10.0,11.0,33.0,89.0,23.0,99.0,99.0,25.0,21.0,...,47.0,28.0,4.0,94.0,72.0,30.0,8.0,26.0,10.0,73.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,54.0,57.0,3.0,19.0,0.0,96.0,45.0,98.0,48.0,25.0,...,10.0,60.0,12.0,48.0,74.0,79.0,94.0,83.0,42.0,27.0
996,3.0,72.0,61.0,10.0,54.0,28.0,11.0,27.0,52.0,56.0,...,96.0,14.0,34.0,65.0,25.0,52.0,57.0,8.0,78.0,66.0
997,68.0,7.0,54.0,46.0,13.0,54.0,0.0,33.0,10.0,76.0,...,59.0,46.0,93.0,91.0,70.0,41.0,87.0,31.0,64.0,86.0
998,18.0,85.0,2.0,16.0,82.0,7.0,35.0,51.0,54.0,27.0,...,86.0,61.0,71.0,51.0,67.0,8.0,3.0,45.0,60.0,90.0
999,70.0,41.0,59.0,91.0,19.0,52.0,13.0,46.0,14.0,97.0,...,86.0,59.0,13.0,53.0,27.0,4.0,5.0,6.0,87.0,11.0

In [18]:
df[0].mean()

49.312

In [14]:
df[19].mean()

49.09

In [16]:
df[999].mean()

50.402

In [20]:
arr = np.load('array2.npy')
arr

array([[42, 56, 23, ..., 66, 67, 60],
       [26, 49,  3, ...,  0, 84, 72],
       [41, 42, 57, ..., 16, 69, 85],
       ...,
       [ 4, 15, 88, ..., 69,  0,  2],
       [13, 24, 75, ..., 99, 31, 42],
       [99, 27, 29, ..., 78, 99, 48]], dtype=int64)

In [21]:
arr[0].mean()

50.227

In [22]:
arr[29].mean()

49.26

In [23]:
arr[-1].mean()

49.437

In [33]:
arr = np.load('data.npz')
np.unique(arr['names']).size

9

In [42]:
arr['ages'][(arr['ages'] < 40)&(arr['surnames'] == 'Smith')&(arr['names'] == 'John')].size

3

In [44]:
s = pd.Series([1, 2, 3, 4])

In [51]:
command = 'mean'

In [52]:
pd.eval(f's.{command}()')

2.5

In [55]:
print(*s[(s > 1) & (s < 4)].index)

1 2

In [57]:
df = pd.read_csv('titanic_train.txt', sep=',')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [58]:
df.Survived.sum()

342

In [2]:
df = pd.read_csv('wines.csv', sep=',')
df.head()

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

In [62]:
df.winery[df.price == df.price.max()]

80290    Château les Ormes Sorbet
Name: winery, dtype: object

In [65]:
df.description[df.country == 'Israel'].count()

505

In [66]:
df.points[df.country == 'Italy'].mean()

88.56223132036847

In [82]:
df.groupby('country').country.count().idxmax()

'US'

In [95]:
df.groupby('country').count()[df.groupby('country').country.count() == 109]

,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
country,,,,,,,,,,,,
Uruguay,109,95,109,109,109,0,0,109,109,109,109,109

In [105]:
df[df.country == 'France'].groupby(['country', 'province']).province.count().idxmin()[1]

'Languedoc-Roussillon'

In [116]:
df.groupby(['country', 'province']).points.mean().idxmax()

('Austria', 'Südburgenland')

In [123]:
(df.groupby('country').points.max() < 95).sum()

29

In [6]:
df.groupby('taster_name').points.mean().idxmin()

'Alexander Peartree'

In [11]:
df[df.taster_name == 'Roger Voss'].groupby('country').points.mean().sort_values(ascending=False).head(3)

country
US              89.500000
Austria         89.163717
South Africa    89.045455
Name: points, dtype: float64

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/bykov-alexei/data-science-course/master/Python3/titanic_train.csv', sep=',')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
df.Name[df.Name.str.contains('Sir. ')].count()

1

In [28]:
df[df.Name.str.contains('Capt')].Fare

745    71.0
Name: Fare, dtype: float64

In [43]:
pd.to_datetime(input()).day_name()

20 2022 july

'Wednesday'

In [56]:
df = pd.read_csv('https://raw.githubusercontent.com/bykov-alexei/data-science-course/master/Pandas/crime.csv'
                 , sep=','
                 , encoding='windows-1254'
                 , date_parser=['OCCURRED_ON_DATE'])
df.head()
# не срабатывает date_parser: колонка так и остается типа object

,INCIDENT_NUMBER,OFFENSE_CODE,OFFENSE_CODE_GROUP,OFFENSE_DESCRIPTION,DISTRICT,REPORTING_AREA,SHOOTING,OCCURRED_ON_DATE,YEAR,MONTH,DAY_OF_WEEK,HOUR,UCR_PART,STREET,Lat,Long,Location
0,I182070945,619,Larceny,LARCENY ALL OTHERS,D14,808,NaN,2018-09-02 13:00:00,2018,9,Sunday,13,Part One,LINCOLN ST,42.357791,-71.139371,"(42.35779134, -71.13937053)"
1,I182070943,1402,Vandalism,VANDALISM,C11,347,NaN,2018-08-21 00:00:00,2018,8,Tuesday,0,Part Two,HECLA ST,42.306821,-71.060300,"(42.30682138, -71.06030035)"
2,I182070941,3410,Towed,TOWED MOTOR VEHICLE,D4,151,NaN,2018-09-03 19:27:00,2018,9,Monday,19,Part Three,CAZENOVE ST,42.346589,-71.072429,"(42.34658879, -71.07242943)"
3,I182070940,3114,Investigate Property,INVESTIGATE PROPERTY,D4,272,NaN,2018-09-03 21:16:00,2018,9,Monday,21,Part Three,NEWCOMB ST,42.334182,-71.078664,"(42.33418175, -71.07866441)"
4,I182070938,3114,Investigate Property,INVESTIGATE PROPERTY,B3,421,NaN,2018-09-03 21:05:00,2018,9,Monday,21,Part Three,DELHI ST,42.275365,-71.090361,"(42.27536542, -71.09036101)"

In [63]:
df.OCCURRED_ON_DATE[(df.OCCURRED_ON_DATE >= '2015-06-15 08:00:00') & (df.OCCURRED_ON_DATE < '2015-06-15 09:00:00')].count()

12

In [65]:
df.OCCURRED_ON_DATE = pd.to_datetime(df.OCCURRED_ON_DATE)

In [68]:
df.OCCURRED_ON_DATE.dtype

dtype('<M8[ns]')

In [69]:
df.OCCURRED_ON_DATE[(df.OCCURRED_ON_DATE >= '2015-06-15 06:00:00') & (df.OCCURRED_ON_DATE < '2015-06-15 09:00:00')].count()

22

In [70]:
df.OCCURRED_ON_DATE[(df.OCCURRED_ON_DATE >= '2017-01-01 00:00:00') 
                    & (df.OCCURRED_ON_DATE < '2017-01-02 00:00:00')
                    & (df.OFFENSE_CODE_GROUP == 'Vandalism')].count()

12

In [81]:
df[(df.OFFENSE_CODE_GROUP == 'Vandalism') 
   & (df.OCCURRED_ON_DATE.dt.year == 2017)]\
    .OCCURRED_ON_DATE\
    .dt.date\
    .value_counts()\
    .head(1)

2017-05-05    30
Name: OCCURRED_ON_DATE, dtype: int64

In [3]:
# 2.15
df = pd.read_csv('https://raw.githubusercontent.com/bykov-alexei/data-science-course/master/Python3/moscow%20schools%20-%20winners.csv'
                 , sep=','
                 , encoding='utf-8')
df.head()

,FullName,ShortName,OlympiadType,Stage,Class,Subject,Status,Year,global_id
0,Государственное бюджетное общеобразовательное ...,ГБОУ лицей «Вторая школа»,Всероссийская олимпиада,3,11,Иностранный язык (английский язык),призёр,2012/2013,4472939
1,Государственное бюджетное общеобразовательное ...,ГБОУ лицей «Вторая школа»,Всероссийская олимпиада,3,11,Иностранный язык (английский язык),призёр,2012/2013,4472940
2,Государственное бюджетное общеобразовательное ...,ГБОУ лицей «Вторая школа»,Всероссийская олимпиада,3,10,Иностранный язык (английский язык),призёр,2012/2013,4472941
3,Государственное бюджетное образовательное учре...,ГБОУ СОШ № 26,Всероссийская олимпиада,4,11,Иностранный язык (английский язык),победитель,2012/2013,4472942
4,Государственное бюджетное образовательное учре...,ГБОУ СОШ № 26,Всероссийская олимпиада,3,11,Иностранный язык (английский язык),призёр,2012/2013,4472943

In [29]:
df[(df.Stage == '4') & (df.Subject == 'Математика') & (df.Status == 'победитель')].Stage.count()

46

In [38]:
# то же с query
df.query("Stage == '4' & Subject == 'Математика' & Status == 'победитель'").Stage.count()

46

In [30]:
df[(df.Stage == '3') & (df.Subject == 'Информатика') & (df.Status == 'призёр') & (df.Class == '9')].shape[0]

349

In [33]:
df[(df.Status == 'победитель')].ShortName.value_counts().head(1)

ГБОУ лицей «Вторая школа»    235
Name: ShortName, dtype: int64

In [41]:
# 2.16
df = pd.read_csv('https://raw.githubusercontent.com/bykov-alexei/data-science-course/master/Pandas/bakery.csv'
                 , sep=','
                 , encoding='utf-8')
df.head()

   TransactionNo          Items             DateTime
0              1          Bread  2016-10-30 09:58:11
1              2   Scandinavian  2016-10-30 10:05:34
2              2   Scandinavian  2016-10-30 10:05:34
3              3  Hot chocolate  2016-10-30 10:07:57
4              3            Jam  2016-10-30 10:07:57

In [43]:
df.DateTime = pd.to_datetime(df.DateTime)

0       2016-10-30 09:58:11
1       2016-10-30 10:05:34
2       2016-10-30 10:05:34
3       2016-10-30 10:07:57
4       2016-10-30 10:07:57
                ...
20502   2017-09-04 14:32:58
20503   2017-09-04 14:32:58
20504   2017-09-04 14:57:06
20505   2017-09-04 14:57:06
20506   2017-09-04 15:04:24
Name: DateTime, Length: 20507, dtype: datetime64[ns]

In [46]:
df.Items.nunique()

94

In [49]:
df[df.Items == 'Tea'].Items.count()

1435

In [53]:
df[df.DateTime.dt.date == pd.to_datetime('2017-05-01')].TransactionNo.nunique()

50

In [57]:
df[df.DateTime.dt.day_name() == 'Monday'].TransactionNo.nunique()

1441

In [61]:
df[(df.DateTime.dt.day_name() == 'Saturday') | (df.DateTime.dt.day_name() == 'Sunday')].TransactionNo.nunique()

2962

In [64]:
df['year'] = df.DateTime.dt.year
df['month'] = df.DateTime.dt.month
df.head()

   TransactionNo          Items            DateTime  year  month
0              1          Bread 2016-10-30 09:58:11  2016     10
1              2   Scandinavian 2016-10-30 10:05:34  2016     10
2              2   Scandinavian 2016-10-30 10:05:34  2016     10
3              3  Hot chocolate 2016-10-30 10:07:57  2016     10
4              3            Jam 2016-10-30 10:07:57  2016     10

In [73]:
df.groupby(['year', 'month']).TransactionNo.nunique().sort_values(ascending=False)

year  month
2017  3        1302
2016  11       1279
2017  1        1263
2016  12       1137
2017  2        1016
      4         328
2016  10        325
2017  7         241
      5         215
      8         214
      6         207
      11        201
2016  3         183
      5         173
2017  10        172
      9         168
      12        151
2016  6         148
      2         144
      4         136
      1         124
      7         118
      8         112
      9         108
Name: TransactionNo, dtype: int64

In [9]:
# 2.16
df = pd.read_csv('https://raw.githubusercontent.com/bykov-alexei/data-science-course/master/Pandas/uber.csv'
                 , sep=','
                 , encoding='utf-8')
df.head()

       DATE         TIME                  PICK UP ADDRESS
0  7/1/2014  12:00:00 AM    874 E 139th St Mott Haven, BX
1  7/1/2014  12:01:00 AM    628 E 141st St Mott Haven, BX
2  7/1/2014  12:01:00 AM   601 E 156th St South Bronx, BX
3  7/1/2014  12:01:00 AM    708 E 138th St Mott Haven, BX
4  7/1/2014  12:02:00 AM    700 E 140th St Mott Haven, BX

In [43]:
df = df.set_index(pd.to_datetime(df['DATE'] + ' ' + df['TIME']))

In [11]:
df.columns = df.columns.str.replace(' ', '_')

In [50]:
df.head()

                         DATE         TIME                  PICK_UP_ADDRESS
2014-07-01 00:00:00  7/1/2014  12:00:00 AM    874 E 139th St Mott Haven, BX
2014-07-01 00:01:00  7/1/2014  12:01:00 AM    628 E 141st St Mott Haven, BX
2014-07-01 00:01:00  7/1/2014  12:01:00 AM   601 E 156th St South Bronx, BX
2014-07-01 00:01:00  7/1/2014  12:01:00 AM    708 E 138th St Mott Haven, BX
2014-07-01 00:02:00  7/1/2014  12:02:00 AM    700 E 140th St Mott Haven, BX

In [37]:
df.PICK_UP_ADDRESS.value_counts()[0:1]

 400 Brook Ave Mott Haven, BX    1216
Name: PICK_UP_ADDRESS, dtype: int64

In [39]:
df.DATE.value_counts()[0:1]

9/13/2014    1440
Name: DATE, dtype: int64

In [56]:
df.DATE.resample('W').count().idxmax()

Timestamp('2014-09-14 00:00:00', freq='W-SUN')

In [57]:
# 2.16
df = pd.read_csv('https://raw.githubusercontent.com/bykov-alexei/data-science-course/master/Pandas/disruptions.csv'
                 , sep=','
                 , encoding='utf-8')
df.head()

,Event Description,Year,Date Event Began,Time Event Began,Date of Restoration,Time of Restoration,Respondent,Geographic Areas,NERC Region,Demand Loss (MW),Number of Customers Affected,Tags
0,Severe Weather - Thunderstorms,2014,6/30/2014,8:00 PM,7/2/2014,6:30 PM,Exelon Corporation/ComEd,Illinois,RFC,Unknown,"420,000","severe weather, thunderstorm"
1,Severe Weather - Thunderstorms,2014,6/30/2014,11:20 PM,7/1/2014,5:00 PM,Northern Indiana Public Service Company,North Central Indiana,RFC,Unknown,"127,000","severe weather, thunderstorm"
2,Severe Weather - Thunderstorms,2014,6/30/2014,5:55 PM,7/1/2014,2:53 AM,We Energies,Southeast Wisconsin,MRO,424,"120,000","severe weather, thunderstorm"
3,Physical Attack - Vandalism,2014,6/24/2014,2:54 PM,6/24/2014,2:55 PM,Tennessee Valley Authority,"Nashville, Tennessee",SERC,Unknown,Unknown,"vandalism, physical"
4,Physical Attack - Vandalism,2014,6/19/2014,8:47 AM,6/19/2014,8:48 AM,Tennessee Valley Authority,"Nashville, Tennessee",SERC,Unknown,Unknown,"vandalism, physical"

In [62]:
df.columns = df.columns.str.replace(' ', '_')

In [67]:
df.Date_Event_Began = pd.to_datetime(df.Date_Event_Began)

In [83]:
df.Event_Description\
    .groupby([df.Date_Event_Began.dt.year, df.Date_Event_Began.dt.month])\
    .count()\
    .sort_values(ascending=False)\
    .idxmax()

(2012, 10)

In [71]:
df.Date_Event_Began.dt.year

0      2014
1      2014
2      2014
3      2014
4      2014
       ...
972    2000
973    2000
974    2000
975    2000
976    2000
Name: Date_Event_Began, Length: 977, dtype: int64

In [90]:
df['Date_Time_Event_Began'] = pd.to_datetime(df.Date_Event_Began.astype(str) + ' ' + df.Time_Event_Began)

In [94]:
df['Date_Time_of_Restoration'] = pd.to_datetime(df.Date_of_Restoration.astype(str) + ' ' + df.Time_of_Restoration)

In [100]:
df['Repair_Time'] = df['Date_Time_of_Restoration'] - df['Date_Time_Event_Began']

In [101]:
df.head()

,Event_Description,Year,Date_Event_Began,Time_Event_Began,Date_of_Restoration,Time_of_Restoration,Respondent,Geographic_Areas,NERC_Region,Demand_Loss_(MW),Number_of_Customers_Affected,Tags,Date_Time_Event_Began,Date_Time_of_Restoration,Repair_Time
0,Severe Weather - Thunderstorms,2014,2014-06-30,8:00 PM,7/2/2014,6:30 PM,Exelon Corporation/ComEd,Illinois,RFC,Unknown,"420,000","severe weather, thunderstorm",2014-06-30 20:00:00,2014-07-02 18:30:00,1 days 22:30:00
1,Severe Weather - Thunderstorms,2014,2014-06-30,11:20 PM,7/1/2014,5:00 PM,Northern Indiana Public Service Company,North Central Indiana,RFC,Unknown,"127,000","severe weather, thunderstorm",2014-06-30 23:20:00,2014-07-01 17:00:00,0 days 17:40:00
2,Severe Weather - Thunderstorms,2014,2014-06-30,5:55 PM,7/1/2014,2:53 AM,We Energies,Southeast Wisconsin,MRO,424,"120,000","severe weather, thunderstorm",2014-06-30 17:55:00,2014-07-01 02:53:00,0 days 08:58:00
3,Physical Attack - Vandalism,2014,2014-06-24,2:54 PM,6/24/2014,2:55 PM,Tennessee Valley Authority,"Nashville, Tennessee",SERC,Unknown,Unknown,"vandalism, physical",2014-06-24 14:54:00,2014-06-24 14:55:00,0 days 00:01:00
4,Physical Attack - Vandalism,2014,2014-06-19,8:47 AM,6/19/2014,8:48 AM,Tennessee Valley Authority,"Nashville, Tennessee",SERC,Unknown,Unknown,"vandalism, physical",2014-06-19 08:47:00,2014-06-19 08:48:00,0 days 00:01:00

In [171]:
df[df.Repair_Time >= pd.Timedelta(0)]\
    .groupby([df.Date_Time_of_Restoration.dt.year, df.Date_Time_of_Restoration.dt.month])\
    .Repair_Time\
    .mean(numeric_only=False)\
    .sort_values()\
    .idxmin()

(2005, 4)